In [1]:
# 1. Exercício: Carregar um arquivo e exibir as primeiras 5 linhas.

import pandas as pd

df = pd.read_excel('dados_ausentes.xlsx')
df.head()

    Nome  Idade          Cidade  Salário
0   João   28.0       São Paulo   3500.0
1  Maria    NaN  Rio de Janeiro   4500.0
2   José   35.0             NaN      NaN
3    Ana   22.0        Salvador   5000.0
4  Pedro    NaN    Porto Alegre   4800.0

In [2]:
# 2. Exercício: Verificar se há valores NaN nas colunas do DataFrame.

df.isna().sum()

Nome       0
Idade      2
Cidade     1
Salário    1
dtype: int64

In [3]:
# 3. Exercício: Substituir os valores NaN de uma coluna por 0.

df['Salário'] = df['Salário'].fillna(0)
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro   4500.0
2     José   35.0             NaN      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro    NaN    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [4]:
# 4. Exercício: Substituir os valores NaN de uma coluna por um valor específico (por exemplo, a média).

media = df['Idade'].mean()
df['Idade'] = df['Idade'].fillna(media)
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio de Janeiro   4500.0
2     José   35.0             NaN      0.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [5]:
# 5. Exercício: Remover todas as linhas que contêm valores NaN em qualquer coluna

df = df.dropna()
print(df)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   27.0  Rio de Janeiro   4500.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   27.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [10]:
# 6. Exercício: Remover todas as linhas que contêm valores NaN em uma coluna específica.

df2 = pd.read_excel("dados_ausentes.xlsx")
df2 = df2[df2['Salário'].notna()]

print(df2)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro   4500.0
3      Ana   22.0        Salvador   5000.0
4    Pedro    NaN    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [11]:
# 7. Exercício: Substituir valores NaN de uma coluna com a mediana dessa coluna.

mediana = df2['Idade'].median()
df2['Idade'] = df2['Idade'].fillna(mediana)

print(df2)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   22.0  Rio de Janeiro   4500.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   22.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [13]:
# 8. Exercício: Substituir valores NaN de uma coluna com o valor de uma outra coluna.
df3 = pd.read_excel("dados_ausentes.xlsx")
df3['Idade'] = df3['Idade'].fillna(df3['Salário'])

print(df3)

      Nome   Idade          Cidade  Salário
0     João    28.0       São Paulo   3500.0
1    Maria  4500.0  Rio de Janeiro   4500.0
2     José    35.0             NaN      NaN
3      Ana    22.0        Salvador   5000.0
4    Pedro  4800.0    Porto Alegre   4800.0
5      Ana    22.0        Salvador   5000.0
6  Jessica    20.0       são paulo   3410.0
7   Carlos    35.0    porto alegre   2500.0

In [14]:
# 9. Exercício: Preencher valores NaN com o valor anterior (método de "forward fill").
df3 = pd.read_excel("dados_ausentes.xlsx")
df3 = df3.fillna(method='ffill')

print(df3)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   28.0  Rio de Janeiro   4500.0
2     José   35.0  Rio de Janeiro   4500.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   22.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

C:\Users\49439967870\AppData\Local\Temp\ipykernel_20076\29806305.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df3 = df3.fillna(method='ffill')

In [15]:
# 10. Exercício: Preencher valores NaN com o valor posterior (método de "backward fill").
df4 = pd.read_excel("dados_ausentes.xlsx")
df4 = df4.fillna(method='bfill')

print(df4)

      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria   35.0  Rio de Janeiro   4500.0
2     José   35.0        Salvador   5000.0
3      Ana   22.0        Salvador   5000.0
4    Pedro   22.0    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

C:\Users\49439967870\AppData\Local\Temp\ipykernel_20076\2081469987.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df4 = df4.fillna(method='bfill')

In [18]:
# 11. Exercício: Alterar todos os valores de uma coluna para maiúsculas.
df5 = pd.read_excel("dados_ausentes.xlsx")
df5['Cidade'] = df5['Cidade'].str.upper()

print(df5)

      Nome  Idade          Cidade  Salário
0     João   28.0       SÃO PAULO   3500.0
1    Maria    NaN  RIO DE JANEIRO   4500.0
2     José   35.0             NaN      NaN
3      Ana   22.0        SALVADOR   5000.0
4    Pedro    NaN    PORTO ALEGRE   4800.0
5      Ana   22.0        SALVADOR   5000.0
6  Jessica   20.0       SÃO PAULO   3410.0
7   Carlos   35.0    PORTO ALEGRE   2500.0

In [19]:
# 12. Exercício: Alterar todos os valores de uma coluna para minúsculas.
df5 = pd.read_excel("dados_ausentes.xlsx")
df5['Cidade'] = df5['Cidade'].str.lower()

print(df5)

      Nome  Idade          Cidade  Salário
0     João   28.0       são paulo   3500.0
1    Maria    NaN  rio de janeiro   4500.0
2     José   35.0             NaN      NaN
3      Ana   22.0        salvador   5000.0
4    Pedro    NaN    porto alegre   4800.0
5      Ana   22.0        salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [21]:
# 13. Exercício: Remover espaços em branco à esquerda e à direita em uma coluna.
df6 = pd.read_excel("dados_espaçados.xlsx")
print(df6)
df6['Cidade'] = df6['Cidade'].str.strip()
print(df6)

      Nome  Idade                Cidade  Salário
0     João   28.0             São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro         4500.0
2     José   35.0                   NaN      NaN
3      Ana   22.0              Salvador   5000.0
4    Pedro    NaN    Porto Alegre         4800.0
5      Ana   22.0              Salvador   5000.0
6  Jessica   20.0         são paulo       3410.0
7   Carlos   35.0          porto alegre   2500.0
      Nome  Idade          Cidade  Salário
0     João   28.0       São Paulo   3500.0
1    Maria    NaN  Rio de Janeiro   4500.0
2     José   35.0             NaN      NaN
3      Ana   22.0        Salvador   5000.0
4    Pedro    NaN    Porto Alegre   4800.0
5      Ana   22.0        Salvador   5000.0
6  Jessica   20.0       são paulo   3410.0
7   Carlos   35.0    porto alegre   2500.0

In [23]:
# 14. Exercício: Substituir valores de uma coluna com base em um dicionário de mapeamento (ex: "São Paulo" para "SP").

mapeamento = {'São Paulo': 'SP', 'Rio de Janeiro': 'RJ', 'Porto Alegre': 'PA', 'Salvador': 'SA'}
df['Cidade'] = df['Cidade'].replace(mapeamento)

print(df)

      Nome  Idade        Cidade  Salário
0     João   28.0            SP   3500.0
1    Maria   27.0            RJ   4500.0
3      Ana   22.0            SA   5000.0
4    Pedro   27.0            PA   4800.0
5      Ana   22.0            SA   5000.0
6  Jessica   20.0     são paulo   3410.0
7   Carlos   35.0  porto alegre   2500.0

In [24]:
# 15. Exercício: Identificar e remover valores duplicados de um DataFrame.
df = df.drop_duplicates()

print(df)

      Nome  Idade        Cidade  Salário
0     João   28.0            SP   3500.0
1    Maria   27.0            RJ   4500.0
3      Ana   22.0            SA   5000.0
4    Pedro   27.0            PA   4800.0
6  Jessica   20.0     são paulo   3410.0
7   Carlos   35.0  porto alegre   2500.0